In [1]:
#importacion de las librerias
import pandas as pd
import numpy as np
import warnings #Para quitar avisos en las gr√°ficas

In [2]:
df = pd.read_csv("Travel details dataset.csv", index_col=0)

In [3]:
df.head(6)

,Destination,Start date,End date,Duration (days),Traveler name,Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
Trip ID,,,,,,,,,,,,
1,"London, UK",5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
2,"Phuket, Thailand",6/15/2023,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
3,"Bali, Indonesia",7/1/2023,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
4,"New York, USA",8/15/2023,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
5,"Tokyo, Japan",9/10/2023,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200
6,"Paris, France",10/5/2023,10/10/2023,5.0,Michael Brown,42.0,Male,American,Hotel,1500,Flight,800

In [4]:
df["Destination"].unique()

array(['London, UK', 'Phuket, Thailand', 'Bali, Indonesia',
       'New York, USA', 'Tokyo, Japan', 'Paris, France',
       'Sydney, Australia', 'Rio de Janeiro, Brazil',
       'Amsterdam, Netherlands', 'Dubai, United Arab Emirates',
       'Cancun, Mexico', 'Barcelona, Spain', 'Honolulu, Hawaii',
       'Berlin, Germany', 'Marrakech, Morocco', 'Edinburgh, Scotland',
       'Paris', 'Bali', 'London', 'Tokyo', 'New York', 'Sydney', 'Rome',
       'Bangkok', 'Hawaii', 'Barcelona', 'Japan', 'Thailand', 'France',
       'Australia', 'Brazil', 'Greece', 'Egypt', 'Mexico', 'Italy',
       'Spain', 'Canada', 'New York City, USA', 'Bangkok, Thailand',
       'Vancouver, Canada', 'Sydney, AUS', 'Seoul, South Korea',
       'Los Angeles, USA', 'Rome, Italy', 'Cape Town', nan,
       'Cape Town, SA', 'Sydney, Aus', 'Bangkok, Thai', 'Phuket, Thai',
       'Dubai', 'Seoul', 'Rio de Janeiro', 'Amsterdam', 'Phuket',
       'Santorini', 'Phnom Penh', 'Athens, Greece',
       'Cape Town, South Africa', 'Auckland, New Zealand'], dtype=object)

In [5]:
df["Destination"].unique()

array(['London, UK', 'Phuket, Thailand', 'Bali, Indonesia',
       'New York, USA', 'Tokyo, Japan', 'Paris, France',
       'Sydney, Australia', 'Rio de Janeiro, Brazil',
       'Amsterdam, Netherlands', 'Dubai, United Arab Emirates',
       'Cancun, Mexico', 'Barcelona, Spain', 'Honolulu, Hawaii',
       'Berlin, Germany', 'Marrakech, Morocco', 'Edinburgh, Scotland',
       'Paris', 'Bali', 'London', 'Tokyo', 'New York', 'Sydney', 'Rome',
       'Bangkok', 'Hawaii', 'Barcelona', 'Japan', 'Thailand', 'France',
       'Australia', 'Brazil', 'Greece', 'Egypt', 'Mexico', 'Italy',
       'Spain', 'Canada', 'New York City, USA', 'Bangkok, Thailand',
       'Vancouver, Canada', 'Sydney, AUS', 'Seoul, South Korea',
       'Los Angeles, USA', 'Rome, Italy', 'Cape Town', nan,
       'Cape Town, SA', 'Sydney, Aus', 'Bangkok, Thai', 'Phuket, Thai',
       'Dubai', 'Seoul', 'Rio de Janeiro', 'Amsterdam', 'Phuket',
       'Santorini', 'Phnom Penh', 'Athens, Greece',
       'Cape Town, South Africa', 'Auckland, New Zealand'], dtype=object)

In [6]:


def standardize_Destination(Destination):
    if pd.isna(Destination):
        return None  # Manejar valores NaN

    Destination = str(Destination).strip()  # Convertir a string y eliminar espacios

    # Correcciones de errores tipogr√°ficos
    Destination = Destination.replace('Thailandland', 'Thailand')
    Destination = Destination.replace('Australiatralia', 'Australia')

    if ',' in Destination:
        city, country = Destination.split(',', 1)
        city = city.strip()
        country = country.strip()

        # Estandarizar nombres de pa√≠ses
        country = country.replace('UK', 'United Kingdom').replace('USA', 'United States').replace('AUS', 'Australia').replace('Aus', 'Australia').replace('Thai', 'Thailand').replace('SA', 'South Africa')

        return f'{country}, {city}' # Invertir el orden: pa√≠s, ciudad
    else:
        # Rellenar pa√≠ses faltantes
        country_mapping = {
            'Paris': 'France',
            'Bali': 'Indonesia',
            'London': 'United Kingdom',
            'Tokyo': 'Japan',
            'New York': 'United States',
            'Sydney': 'Australia',
            'Rome': 'Italy',
            'Bangkok': 'Thailand',
            'Hawaii': 'United States',
            'Barcelona': 'Spain',
            'Japan': 'Japan',
            'Thailand': 'Thailand',
            'France': 'France',
            'Australia': 'Australia',
            'Brazil': 'Brazil',
            'Greece': 'Greece',
            'Egypt': 'Egypt',
            'Mexico': 'Mexico',
            'Italy': 'Italy',
            'Spain': 'Spain',
            'Canada': 'Canada',
            'Dubai': 'United Arab Emirates',
            'Seoul': 'South Korea',
            'Rio de Janeiro': 'Brazil',
            'Amsterdam': 'Netherlands',
            'Phuket': 'Thailand',
            'Santorini': 'Greece',
            'Phnom Penh': 'Cambodia',
            'Cape Town': 'South Africa',
            'Auckland': 'New Zealand',
            'Cancun': 'Mexico',
            'Honolulu': 'United States',
            'Berlin': 'Germany',
            'Marrakech': 'Morocco',
            'Edinburgh': 'United Kingdom',
            'Canberra': 'Australia',
            'Bras√≠lia': 'Brazil',
            'Athens': 'Greece',
            'Cairo': 'Egypt',
            'Mexico City': 'Mexico',
            'Madrid': 'Spain',
            'Ottawa': 'Canada',
            'Vancouver': 'Canada',
            'Los Angeles': 'United States',
        }
        city = Destination.strip()
        country = country_mapping.get(city)
        if country:
            return f'{country}, {city}' # Invertir el orden: pa√≠s, ciudad
        else:
            return Destination #En caso de no encontrar pais, se mantiene igual.

# Supongamos que tu DataFrame se llama 'df' y la columna 'Destination' es df['Destination']

# Aplicar la funci√≥n a la columna 'Destination'
df['Destination'] = df['Destination'].apply(standardize_Destination)

# Eliminar filas con valores nulos en la columna 'Destination'
df.dropna(subset=['Destination'], inplace=True)

# Imprimir el DataFrame modificado
print(df)

                     Destination Start date   End date  Duration (days)  \
Trip ID
1         United Kingdom, London   5/1/2023   5/8/2023              7.0
2           Thailandland, Phuket  6/15/2023  6/20/2023              5.0
3                Indonesia, Bali   7/1/2023   7/8/2023              7.0
4        United States, New York  8/15/2023  8/29/2023             14.0
5                   Japan, Tokyo  9/10/2023  9/17/2023              7.0
...                          ...        ...        ...              ...
135       Brazil, Rio de Janeiro   8/1/2023  8/10/2023              9.0
136            Canada, Vancouver  8/15/2023  8/21/2023              6.0
137        Thailandland, Bangkok   9/1/2023   9/8/2023              7.0
138             Spain, Barcelona  9/15/2023  9/22/2023              7.0
139        New Zealand, Auckland  10/1/2023  10/8/2023              7.0

           Traveler name  Traveler age Traveler gender Traveler nationality  \
Trip ID
1             John Smith          35.0            Male             American
2               Jane Doe          28.0          Female             Canadian
3              David Lee          45.0            Male               Korean
4          Sarah Johnson          29.0          Female              British
5             Kim Nguyen          26.0          Female           Vietnamese
...                  ...           ...             ...                  ...
135           Jose Perez          37.0            Male            Brazilian
136          Emma Wilson          29.0          Female             Canadian
137            Ryan Chen          34.0            Male              Chinese
138      Sofia Rodriguez          25.0          Female              Spanish
139        William Brown          39.0            Male        New Zealander

        Accommodation type Accommodation cost Transportation type  \
Trip ID
1                    Hotel               1200              Flight
2                   Resort                800              Flight
3                    Villa               1000              Flight
4                    Hotel               2000              Flight
5                   Airbnb                700               Train
...                    ...                ...                 ...
135                 Hostel               2500                 Car
136                  Hotel               5000            Airplane
137                 Hostel               2000               Train
138                 Airbnb               6000            Airplane
139                  Hotel               7000               Train

        Transportation cost
Trip ID
1                       600
2                       500
3                       700
4                      1000
5                       200
...                     ...
135                    2000
136                    3000
137                    1000
138                    2500
139                    2500

[137 rows x 12 columns]

In [7]:
df["Destination"].unique()

array(['United Kingdom, London', 'Thailandland, Phuket',
       'Indonesia, Bali', 'United States, New York', 'Japan, Tokyo',
       'France, Paris', 'Australiatralia, Sydney',
       'Brazil, Rio de Janeiro', 'Netherlands, Amsterdam',
       'United Arab Emirates, Dubai', 'Mexico, Cancun',
       'Spain, Barcelona', 'Hawaii, Honolulu', 'Germany, Berlin',
       'Morocco, Marrakech', 'Scotland, Edinburgh', 'Australia, Sydney',
       'Italy, Rome', 'Thailand, Bangkok', 'United States, Hawaii',
       'Japan, Japan', 'Thailand, Thailand', 'France, France',
       'Australia, Australia', 'Brazil, Brazil', 'Greece, Greece',
       'Egypt, Egypt', 'Mexico, Mexico', 'Italy, Italy', 'Spain, Spain',
       'Canada, Canada', 'United States, New York City',
       'Thailandland, Bangkok', 'Canada, Vancouver', 'South Korea, Seoul',
       'United States, Los Angeles', 'South Africa, Cape Town',
       'Thailand, Phuket', 'Greece, Santorini', 'Cambodia, Phnom Penh',
       'Greece, Athens', 'New Zealand, Auckland'], dtype=object)

In [8]:
# Diccionario de pa√≠ses y capitales
country_capitals = {
    'Japan': 'Tokyo',
    'Thailand': 'Bangkok',
    'France': 'Paris',
    'Australia': 'Sydney', #En este caso Sydney no es la capital, pero se mantiene ya que es la ciudad que aparece en los datos.
    'Brazil': 'Rio de Janeiro',#En este caso Rio de Janeiro no es la capital, pero se mantiene ya que es la ciudad que aparece en los datos.
    'Greece': 'Athens',
    'Egypt': 'Cairo',
    'Mexico': 'Mexico City',
    'Italy': 'Rome',
    'Spain': 'Madrid',
    'Canada': 'Vancouver' #En este caso Vancouver no es la capital, pero se mantiene ya que es la ciudad que aparece en los datos.
}

# Funci√≥n para cambiar el formato de los pa√≠ses duplicados
def change_country_format(destination):
    parts = destination.split(', ')
    if len(parts) == 2 and parts[0] == parts[1] and parts[0] in country_capitals:
        return f"{parts[0]}, {country_capitals[parts[0]]}"
    return destination

# Aplicar la funci√≥n a la columna 'Destination'
df['Destination'] = df['Destination'].apply(change_country_format)

print(df['Destination'])

Trip ID
1       United Kingdom, London
2         Thailandland, Phuket
3              Indonesia, Bali
4      United States, New York
5                 Japan, Tokyo
                ...
135     Brazil, Rio de Janeiro
136          Canada, Vancouver
137      Thailandland, Bangkok
138           Spain, Barcelona
139      New Zealand, Auckland
Name: Destination, Length: 137, dtype: object

In [36]:
# Supongamos que tu DataFrame se llama 'df'
valores_a_eliminar = ['Thailandland, Phuket', 'Australiatralia, Sydney', 'Hawaii, Honolulu']

# Reemplaza los valores por NaN
df['Destination'] = df['Destination'].replace(valores_a_eliminar, np.nan)

# O si quieres reemplazarlos por una cadena vac√≠a:
# df['Destination'] = df['Destination'].replace(valores_a_eliminar, '')

In [37]:
df["Destination"].unique()

array(['United Kingdom, London', nan, 'Indonesia, Bali',
       'United States, New York', 'Japan, Tokyo', 'France, Paris',
       'Brazil, Rio de Janeiro', 'Netherlands, Amsterdam',
       'United Arab Emirates, Dubai', 'Mexico, Cancun',
       'Spain, Barcelona', 'Germany, Berlin', 'Morocco, Marrakech',
       'Scotland, Edinburgh', 'Australia, Sydney', 'Italy, Rome',
       'Thailand, Bangkok', 'United States, Hawaii', 'Greece, Athens',
       'Egypt, Cairo', 'Mexico, Mexico City', 'Spain, Madrid',
       'Canada, Vancouver', 'United States, New York City',
       'Thailandland, Bangkok', 'South Korea, Seoul',
       'United States, Los Angeles', 'South Africa, Cape Town',
       'Thailand, Phuket', 'Greece, Santorini', 'Cambodia, Phnom Penh',
       'New Zealand, Auckland'], dtype=object)

In [41]:
# Supongamos que tu DataFrame se llama 'df'
df.dropna(subset=['Destination'], inplace=True)

In [42]:
df["Destination"].unique()

array(['United Kingdom, London', 'Indonesia, Bali',
       'United States, New York', 'Japan, Tokyo', 'France, Paris',
       'Brazil, Rio de Janeiro', 'Netherlands, Amsterdam',
       'United Arab Emirates, Dubai', 'Mexico, Cancun',
       'Spain, Barcelona', 'Germany, Berlin', 'Morocco, Marrakech',
       'Scotland, Edinburgh', 'Australia, Sydney', 'Italy, Rome',
       'Thailand, Bangkok', 'United States, Hawaii', 'Greece, Athens',
       'Egypt, Cairo', 'Mexico, Mexico City', 'Spain, Madrid',
       'Canada, Vancouver', 'United States, New York City',
       'Thailandland, Bangkok', 'South Korea, Seoul',
       'United States, Los Angeles', 'South Africa, Cape Town',
       'Thailand, Phuket', 'Greece, Santorini', 'Cambodia, Phnom Penh',
       'New Zealand, Auckland'], dtype=object)

In [45]:
# Reemplazar 'Thailandland' por 'Thailand' en la columna 'Destination'
df['Destination'] = df['Destination'].str.replace('Thailandland', 'Thailand')

In [46]:
df["Destination"].unique()

array(['United Kingdom, London', 'Indonesia, Bali',
       'United States, New York', 'Japan, Tokyo', 'France, Paris',
       'Brazil, Rio de Janeiro', 'Netherlands, Amsterdam',
       'United Arab Emirates, Dubai', 'Mexico, Cancun',
       'Spain, Barcelona', 'Germany, Berlin', 'Morocco, Marrakech',
       'Scotland, Edinburgh', 'Australia, Sydney', 'Italy, Rome',
       'Thailand, Bangkok', 'United States, Hawaii', 'Greece, Athens',
       'Egypt, Cairo', 'Mexico, Mexico City', 'Spain, Madrid',
       'Canada, Vancouver', 'United States, New York City',
       'South Korea, Seoul', 'United States, Los Angeles',
       'South Africa, Cape Town', 'Thailand, Phuket', 'Greece, Santorini',
       'Cambodia, Phnom Penh', 'New Zealand, Auckland'], dtype=object)

In [44]:
# Muestra el tipo de dato de cada columna.
df.dtypes

Destination                     object
Start date              datetime64[ns]
End date                datetime64[ns]
Duration (days)                  int32
Traveler name                   object
Traveler age                     int32
Traveler gender                 object
Traveler nationality            object
Accommodation type              object
Accommodation cost               int64
Transportation type             object
Transportation cost              int64
dtype: object

In [13]:
# Cuenta y muestra el n√∫mero de valores nulos por columna.
df.isnull().sum()

Destination             0
Start date              0
End date                0
Duration (days)         0
Traveler name           0
Traveler age            0
Traveler gender         0
Traveler nationality    0
Accommodation type      0
Accommodation cost      0
Transportation type     1
Transportation cost     1
dtype: int64

In [14]:
# Imputar con la mediana (para columnas num√©ricas)
df['Traveler age'].fillna(df['Traveler age'].median(), inplace=True)

C:\Users\hyena\AppData\Local\Temp\ipykernel_6860\1784565681.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Traveler age'].fillna(df['Traveler age'].median(), inplace=True)

In [15]:
 #Imputar con la moda (para columnas categ√≥ricas)
df['Destination'].fillna(df['Destination'].mode()[0], inplace=True)
df['Traveler name'].fillna(df['Traveler name'].mode()[0], inplace=True)
df['Traveler gender'].fillna(df['Traveler gender'].mode()[0], inplace=True)
df['Traveler nationality'].fillna(df['Traveler nationality'].mode()[0], inplace=True)
df['Accommodation type'].fillna(df['Accommodation type'].mode()[0], inplace=True)
df['Transportation type'].fillna(df['Transportation type'].mode()[0], inplace=True)

C:\Users\hyena\AppData\Local\Temp\ipykernel_6860\3825326280.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Destination'].fillna(df['Destination'].mode()[0], inplace=True)
C:\Users\hyena\AppData\Local\Temp\ipykernel_6860\3825326280.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Traveler name'].fillna(df['Traveler name'].mode()[0], inplace=True)
C:\Users\hyena\AppData\Local\Temp\ipykernel_6860\3825326280.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Traveler gender'].fillna(df['Traveler gender'].mode()[0], inplace=True)
C:\Users\hyena\AppData\Local\Temp\ipykernel_6860\3825326280.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Traveler nationality'].fillna(df['Traveler nationality'].mode()[0], inplace=True)
C:\Users\hyena\AppData\Local\Temp\ipykernel_6860\3825326280.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Accommodation type'].fillna(df['Accommodation type'].mode()[0], inplace=True)
C:\Users\hyena\AppData\Local\Temp\ipykernel_6860\3825326280.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Transportation type'].fillna(df['Transportation type'].mode()[0], inplace=True)

In [16]:
#convertir Start date y End date a tipo datetime usando pd.to_datetime()

df['Start date'] = pd.to_datetime(df['Start date'], errors='coerce')
df['End date'] = pd.to_datetime(df['End date'], errors='coerce')

In [17]:
#eliminar nulos (es uno por cada fila)
df.dropna(subset=['Start date', 'End date', 'Transportation cost'], inplace=True)

In [18]:
 #limpiar los datos de cualquier caracter que impida la correcta conversi√≥n, como simbolos de moneda, o comas usadas como separador de miles.
df['Accommodation cost'] = pd.to_numeric(df['Accommodation cost'].str.replace('[^\d\.]', '', regex=True), errors='coerce')
df['Transportation cost'] = pd.to_numeric(df['Transportation cost'].str.replace('[^\d\.]', '', regex=True), errors='coerce')

<>:2: SyntaxWarning: invalid escape sequence '\d'
<>:3: SyntaxWarning: invalid escape sequence '\d'
<>:2: SyntaxWarning: invalid escape sequence '\d'
<>:3: SyntaxWarning: invalid escape sequence '\d'
C:\Users\hyena\AppData\Local\Temp\ipykernel_6860\1918027900.py:2: SyntaxWarning: invalid escape sequence '\d'
  df['Accommodation cost'] = pd.to_numeric(df['Accommodation cost'].str.replace('[^\d\.]', '', regex=True), errors='coerce')
C:\Users\hyena\AppData\Local\Temp\ipykernel_6860\1918027900.py:3: SyntaxWarning: invalid escape sequence '\d'
  df['Transportation cost'] = pd.to_numeric(df['Transportation cost'].str.replace('[^\d\.]', '', regex=True), errors='coerce')

In [19]:
df.isnull().sum()

Destination             0
Start date              0
End date                0
Duration (days)         0
Traveler name           0
Traveler age            0
Traveler gender         0
Traveler nationality    0
Accommodation type      0
Accommodation cost      0
Transportation type     0
Transportation cost     0
dtype: int64

In [20]:
# Muestra el n√∫mero total de filas duplicadas.
df.duplicated().sum()

0

In [21]:
#Eliminamos duplicados 
df.drop_duplicates(inplace=True)

In [22]:
#Asegurarse que se han eliminado
df.duplicated().sum()

0

In [23]:
# Mostrar n√∫mero de filas y columnas.
df.shape

(136, 12)

In [24]:
df.head()

,Destination,Start date,End date,Duration (days),Traveler name,Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
Trip ID,,,,,,,,,,,,
1,"United Kingdom, London",2023-05-01,2023-05-08,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
2,"Thailandland, Phuket",2023-06-15,2023-06-20,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
3,"Indonesia, Bali",2023-07-01,2023-07-08,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
4,"United States, New York",2023-08-15,2023-08-29,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
5,"Japan, Tokyo",2023-09-10,2023-09-17,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200

In [25]:
# Convertir 'Duration (days)' y 'Traveler age' a enteros
df['Duration (days)'] = df['Duration (days)'].astype(int)
df['Traveler age'] = df['Traveler age'].astype(int)

In [26]:
# Muestra el tipo de dato de cada columna.
df.dtypes

Destination                     object
Start date              datetime64[ns]
End date                datetime64[ns]
Duration (days)                  int32
Traveler name                   object
Traveler age                     int32
Traveler gender                 object
Traveler nationality            object
Accommodation type              object
Accommodation cost               int64
Transportation type             object
Transportation cost              int64
dtype: object

In [27]:
#crear df limpio
df_limpio = df.copy()

In [28]:
#Guardar el df en un csv
df_limpio.to_csv('datos_limpios.csv', index=False)

In [29]:
df_limpio = pd.read_csv("datos_limpios.csv")

In [30]:
df_limpio.head()

,Destination,Start date,End date,Duration (days),Traveler name,Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
0,"United Kingdom, London",2023-05-01,2023-05-08,7,John Smith,35,Male,American,Hotel,1200,Flight,600
1,"Thailandland, Phuket",2023-06-15,2023-06-20,5,Jane Doe,28,Female,Canadian,Resort,800,Flight,500
2,"Indonesia, Bali",2023-07-01,2023-07-08,7,David Lee,45,Male,Korean,Villa,1000,Flight,700
3,"United States, New York",2023-08-15,2023-08-29,14,Sarah Johnson,29,Female,British,Hotel,2000,Flight,1000
4,"Japan, Tokyo",2023-09-10,2023-09-17,7,Kim Nguyen,26,Female,Vietnamese,Airbnb,700,Train,200

In [35]:
df_limpio["Destination"].unique()

array(['United Kingdom, London', 'Thailandland, Phuket',
       'Indonesia, Bali', 'United States, New York', 'Japan, Tokyo',
       'France, Paris', 'Australiatralia, Sydney',
       'Brazil, Rio de Janeiro', 'Netherlands, Amsterdam',
       'United Arab Emirates, Dubai', 'Mexico, Cancun',
       'Spain, Barcelona', 'Hawaii, Honolulu', 'Germany, Berlin',
       'Morocco, Marrakech', 'Scotland, Edinburgh', 'Australia, Sydney',
       'Italy, Rome', 'Thailand, Bangkok', 'United States, Hawaii',
       'Greece, Athens', 'Egypt, Cairo', 'Mexico, Mexico City',
       'Spain, Madrid', 'Canada, Vancouver',
       'United States, New York City', 'Thailandland, Bangkok',
       'South Korea, Seoul', 'United States, Los Angeles',
       'South Africa, Cape Town', 'Thailand, Phuket', 'Greece, Santorini',
       'Cambodia, Phnom Penh', 'New Zealand, Auckland'], dtype=object)

In [31]:
df_limpio.dtypes

Destination             object
Start date              object
End date                object
Duration (days)          int64
Traveler name           object
Traveler age             int64
Traveler gender         object
Traveler nationality    object
Accommodation type      object
Accommodation cost       int64
Transportation type     object
Transportation cost      int64
dtype: object

In [32]:
df_limpio.isnull().sum()

Destination             0
Start date              0
End date                0
Duration (days)         0
Traveler name           0
Traveler age            0
Traveler gender         0
Traveler nationality    0
Accommodation type      0
Accommodation cost      0
Transportation type     0
Transportation cost     0
dtype: int64